import carla

# 路口ID及其位置
junctions = {
    1627: carla.Location(x=232, y=-520, z=46),  # 尖山路与旺龙路交叉口
    1316: carla.Location(x=-591, y=-198, z=62),  # 青山路与旺龙路西交叉口
    616: carla.Location(x=83, y=48, z=44),   # 青山路与尖山路交叉口
    721:  carla.Location(x=-909, y=347.5, z=43.8),  # 旺龙路与岳麓大道桥下路口
    201: carla.Location(x=839, y=98, z=50.4),   # 望青路与青山路交叉口
    351:  carla.Location(x=877.5, y=680, z=35)   # 岳麓大道与麓谷大道交叉口
}

junction_name_dict = {
    1627: "尖山路与旺龙路交叉口",
    1316: "青山路与旺龙路西交叉口",
    616: "青山路与尖山路交叉口",
    721: "旺龙路与岳麓大道桥下路口",
    201: "望青路与青山路交叉口",
    351: "岳麓大道与麓谷大道交叉口"
}